# Group by
arranging particular columns or rows of data
 * dataFrame.group(['column1', 'column2'])
 * dataFrame.groupby(['column1', 'column2'])[['col1', 'col2']].aggregate([len,min,max])
 * dataFrame.groupby(['column1', 'column2'])[['col1', 'col2']].aplly(functions())

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import pandera as pa
from pandera.typing import DataFrame, Series
import random

In [3]:
import pandas as pd
from datetime import datetime
from typing import List
import pandera as pa
from pandera.typing import DataFrame, Series

# Define the data structure with static type annotations
class Student:
    def __init__(self, roll_no: int, name: str, fathername: str, date_of_admission: datetime, fee: int, course: str):
        self.roll_no = roll_no
        self.name = name
        self.fathername = fathername
        self.date_of_admission = date_of_admission
        self.fee = fee
        self.course = course

# Create a list of students
students: List[Student] = [
    Student(1, "Alice", "John", datetime(2022, 1, 10), 1500, "Mathematics"),
    Student(2, "Bob", "Robert", datetime(2022, 2, 14), 2000, "Physics"),
    Student(3, "Charlie", "Michael", datetime(2022, 3, 18), 1500, "Chemistry"),
    Student(4, "David", "William", datetime(2022, 4, 22), 2500, "Mathematics"),
    Student(5, "Eva", "Richard", datetime(2022, 5, 26), 2000, "Computer Science"),
    Student(6, "Frank", "Joseph", datetime(2022, 6, 30), 1500, "Mathematics"),
    Student(7, "Grace", "Charles", datetime(2022, 7, 4), 2500, "Physics"),
    Student(8, "Hannah", "Thomas", datetime(2022, 8, 8), 2000, "Mathematics"),
    Student(9, "Ivan", "Christopher", datetime(2022, 9, 12), 1500, "Biology"),
    Student(10, "Jack", "Daniel", datetime(2022, 10, 16), 2500, "Computer Science")
]

# Convert the list of students to a DataFrame
student_df = pd.DataFrame([{
    "roll_no": student.roll_no,
    "name": student.name,
    "fathername": student.fathername,
    "course": student.course,
    "date_of_admission": student.date_of_admission,
    "fee": student.fee,
} for student in students])

# Define the schema using pandera

class StudentSchema(pa.SchemaModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field()
    fathername: Series[str] = pa.Field()
    course: Series[str] = pa.Field()
    date_of_admission: Series[datetime] = pa.Field()
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True

# Validate the DataFrame
validated_student_df: DataFrame[StudentSchema] = StudentSchema.validate(student_df)

# Display the validated DataFrame
print(validated_student_df)

   roll_no     name   fathername            course date_of_admission   fee
0        1    Alice         John       Mathematics        2022-01-10  1500
1        2      Bob       Robert           Physics        2022-02-14  2000
2        3  Charlie      Michael         Chemistry        2022-03-18  1500
3        4    David      William       Mathematics        2022-04-22  2500
4        5      Eva      Richard  Computer Science        2022-05-26  2000
5        6    Frank       Joseph       Mathematics        2022-06-30  1500
6        7    Grace      Charles           Physics        2022-07-04  2500
7        8   Hannah       Thomas       Mathematics        2022-08-08  2000
8        9     Ivan  Christopher           Biology        2022-09-12  1500
9       10     Jack       Daniel  Computer Science        2022-10-16  2500

In [5]:
student_df

   roll_no     name   fathername            course date_of_admission   fee
0        1    Alice         John       Mathematics        2022-01-10  1500
1        2      Bob       Robert           Physics        2022-02-14  2000
2        3  Charlie      Michael         Chemistry        2022-03-18  1500
3        4    David      William       Mathematics        2022-04-22  2500
4        5      Eva      Richard  Computer Science        2022-05-26  2000
5        6    Frank       Joseph       Mathematics        2022-06-30  1500
6        7    Grace      Charles           Physics        2022-07-04  2500
7        8   Hannah       Thomas       Mathematics        2022-08-08  2000
8        9     Ivan  Christopher           Biology        2022-09-12  1500
9       10     Jack       Daniel  Computer Science        2022-10-16  2500

In [6]:
student_df.groupby(['course'])

In [7]:
list(student_df.groupby(['course']))

[(('Biology',),
     roll_no  name   fathername   course date_of_admission   fee
  8        9  Ivan  Christopher  Biology        2022-09-12  1500),
 (('Chemistry',),
     roll_no     name fathername     course date_of_admission   fee
  2        3  Charlie    Michael  Chemistry        2022-03-18  1500),
 (('Computer Science',),
     roll_no  name fathername            course date_of_admission   fee
  4        5   Eva    Richard  Computer Science        2022-05-26  2000
  9       10  Jack     Daniel  Computer Science        2022-10-16  2500),
 (('Mathematics',),
     roll_no    name fathername       course date_of_admission   fee
  0        1   Alice       John  Mathematics        2022-01-10  1500
  3        4   David    William  Mathematics        2022-04-22  2500
  5        6   Frank     Joseph  Mathematics        2022-06-30  1500
  7        8  Hannah     Thomas  Mathematics        2022-08-08  2000),
 (('Physics',),
     roll_no   name fathername   course date_of_admission   fee
  1        2    Bob     Robert  Physics        2022-02-14  2000
  6        7  Grace    Charles  Physics        2022-07-04  2500)]

In [8]:
list(student_df.groupby(['course']))[0]

(('Biology',),
    roll_no  name   fathername   course date_of_admission   fee
 8        9  Ivan  Christopher  Biology        2022-09-12  1500)

In [9]:
list(student_df.groupby(['course']))[0][0]

('Biology',)

In [10]:
list(student_df.groupby(['course']))[0][1]

   roll_no  name   fathername   course date_of_admission   fee
8        9  Ivan  Christopher  Biology        2022-09-12  1500

In [13]:
for group in list(student_df.groupby(['course'])):
 display(group[0])
 display(group[1])
 print('=============================================================')

('Biology',)

   roll_no  name   fathername   course date_of_admission   fee
8        9  Ivan  Christopher  Biology        2022-09-12  1500

=============================================================

('Chemistry',)

   roll_no     name fathername     course date_of_admission   fee
2        3  Charlie    Michael  Chemistry        2022-03-18  1500

=============================================================

('Computer Science',)

   roll_no  name fathername            course date_of_admission   fee
4        5   Eva    Richard  Computer Science        2022-05-26  2000
9       10  Jack     Daniel  Computer Science        2022-10-16  2500

=============================================================

('Mathematics',)

   roll_no    name fathername       course date_of_admission   fee
0        1   Alice       John  Mathematics        2022-01-10  1500
3        4   David    William  Mathematics        2022-04-22  2500
5        6   Frank     Joseph  Mathematics        2022-06-30  1500
7        8  Hannah     Thomas  Mathematics        2022-08-08  2000

=============================================================

('Physics',)

   roll_no   name fathername   course date_of_admission   fee
1        2    Bob     Robert  Physics        2022-02-14  2000
6        7  Grace    Charles  Physics        2022-07-04  2500

=============================================================

In [16]:
for group in list(student_df.groupby([student_df['date_of_admission'].dt.strftime('%Y')])):
 display(group[0])
 display(group[1])
 print('=============================================================')

('2022',)

   roll_no     name   fathername            course date_of_admission   fee
0        1    Alice         John       Mathematics        2022-01-10  1500
1        2      Bob       Robert           Physics        2022-02-14  2000
2        3  Charlie      Michael         Chemistry        2022-03-18  1500
3        4    David      William       Mathematics        2022-04-22  2500
4        5      Eva      Richard  Computer Science        2022-05-26  2000
5        6    Frank       Joseph       Mathematics        2022-06-30  1500
6        7    Grace      Charles           Physics        2022-07-04  2500
7        8   Hannah       Thomas       Mathematics        2022-08-08  2000
8        9     Ivan  Christopher           Biology        2022-09-12  1500
9       10     Jack       Daniel  Computer Science        2022-10-16  2500

=============================================================

In [17]:
for group in list(student_df.groupby([student_df['date_of_admission'].dt.strftime('%B')])):
 display(group[0])
 display(group[1])
 print('=============================================================')

('April',)

   roll_no   name fathername       course date_of_admission   fee
3        4  David    William  Mathematics        2022-04-22  2500

=============================================================

('August',)

   roll_no    name fathername       course date_of_admission   fee
7        8  Hannah     Thomas  Mathematics        2022-08-08  2000

=============================================================

('February',)

   roll_no name fathername   course date_of_admission   fee
1        2  Bob     Robert  Physics        2022-02-14  2000

=============================================================

('January',)

   roll_no   name fathername       course date_of_admission   fee
0        1  Alice       John  Mathematics        2022-01-10  1500

=============================================================

('July',)

   roll_no   name fathername   course date_of_admission   fee
6        7  Grace    Charles  Physics        2022-07-04  2500

=============================================================

('June',)

   roll_no   name fathername       course date_of_admission   fee
5        6  Frank     Joseph  Mathematics        2022-06-30  1500

=============================================================

('March',)

   roll_no     name fathername     course date_of_admission   fee
2        3  Charlie    Michael  Chemistry        2022-03-18  1500

=============================================================

('May',)

   roll_no name fathername            course date_of_admission   fee
4        5  Eva    Richard  Computer Science        2022-05-26  2000

=============================================================

('October',)

   roll_no  name fathername            course date_of_admission   fee
9       10  Jack     Daniel  Computer Science        2022-10-16  2500

=============================================================

('September',)

   roll_no  name   fathername   course date_of_admission   fee
8        9  Ivan  Christopher  Biology        2022-09-12  1500

=============================================================

In [18]:
for group in list(student_df.groupby([student_df['date_of_admission'].dt.strftime('%B'), student_df['course']])):
 display(group[0])
 display(group[1])
 print('=============================================================')

('April', 'Mathematics')

   roll_no   name fathername       course date_of_admission   fee
3        4  David    William  Mathematics        2022-04-22  2500

=============================================================

('August', 'Mathematics')

   roll_no    name fathername       course date_of_admission   fee
7        8  Hannah     Thomas  Mathematics        2022-08-08  2000

=============================================================

('February', 'Physics')

   roll_no name fathername   course date_of_admission   fee
1        2  Bob     Robert  Physics        2022-02-14  2000

=============================================================

('January', 'Mathematics')

   roll_no   name fathername       course date_of_admission   fee
0        1  Alice       John  Mathematics        2022-01-10  1500

=============================================================

('July', 'Physics')

   roll_no   name fathername   course date_of_admission   fee
6        7  Grace    Charles  Physics        2022-07-04  2500

=============================================================

('June', 'Mathematics')

   roll_no   name fathername       course date_of_admission   fee
5        6  Frank     Joseph  Mathematics        2022-06-30  1500

=============================================================

('March', 'Chemistry')

   roll_no     name fathername     course date_of_admission   fee
2        3  Charlie    Michael  Chemistry        2022-03-18  1500

=============================================================

('May', 'Computer Science')

   roll_no name fathername            course date_of_admission   fee
4        5  Eva    Richard  Computer Science        2022-05-26  2000

=============================================================

('October', 'Computer Science')

   roll_no  name fathername            course date_of_admission   fee
9       10  Jack     Daniel  Computer Science        2022-10-16  2500

=============================================================

('September', 'Biology')

   roll_no  name   fathername   course date_of_admission   fee
8        9  Ivan  Christopher  Biology        2022-09-12  1500

=============================================================

In [19]:
student_df.groupby(['course']).aggregate('count')

                  roll_no  name  fathername  date_of_admission  fee
course
Biology                 1     1           1                  1    1
Chemistry               1     1           1                  1    1
Computer Science        2     2           2                  2    2
Mathematics             4     4           4                  4    4
Physics                 2     2           2                  2    2

In [24]:
student_df.groupby(['course'])[['fee']].aggregate('count')

                  fee
course
Biology             1
Chemistry           1
Computer Science    2
Mathematics         4
Physics             2

In [27]:
student_df.groupby(['course'])[['fee']].aggregate([len, min, max])

C:\Users\ST\AppData\Local\Temp\ipykernel_10516\4281276191.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  student_df.groupby(['course'])[['fee']].aggregate([len, min, max])
C:\Users\ST\AppData\Local\Temp\ipykernel_10516\4281276191.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  student_df.groupby(['course'])[['fee']].aggregate([len, min, max])

                 fee
                 len   min   max
course
Biology            1  1500  1500
Chemistry          1  1500  1500
Computer Science   2  2000  2500
Mathematics        4  1500  2500
Physics            2  2000  2500

In [31]:
student_df.groupby(['course',student_df['date_of_admission'].dt.strftime('%B')])['fee'].agg([len,min, max])

C:\Users\ST\AppData\Local\Temp\ipykernel_10516\1018739046.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  student_df.groupby(['course',student_df['date_of_admission'].dt.strftime('%B')])['fee'].agg([len,min, max])
C:\Users\ST\AppData\Local\Temp\ipykernel_10516\1018739046.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  student_df.groupby(['course',student_df['date_of_admission'].dt.strftime('%B')])['fee'].agg([len,min, max])

                                    len   min   max
course           date_of_admission
Biology          September            1  1500  1500
Chemistry        March                1  1500  1500
Computer Science May                  1  2000  2000
                 October              1  2500  2500
Mathematics      April                1  2500  2500
                 August               1  2000  2000
                 January              1  1500  1500
                 June                 1  1500  1500
Physics          February             1  2000  2000
                 July                 1  2500  2500

In [33]:
student_df.groupby(['course']).apply(lambda x: x.head())

C:\Users\ST\AppData\Local\Temp\ipykernel_10516\1778018046.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  student_df.groupby(['course']).apply(lambda x: x.head())

                    roll_no     name   fathername            course  \
course
Biology          8        9     Ivan  Christopher           Biology
Chemistry        2        3  Charlie      Michael         Chemistry
Computer Science 4        5      Eva      Richard  Computer Science
                 9       10     Jack       Daniel  Computer Science
Mathematics      0        1    Alice         John       Mathematics
                 3        4    David      William       Mathematics
                 5        6    Frank       Joseph       Mathematics
                 7        8   Hannah       Thomas       Mathematics
Physics          1        2      Bob       Robert           Physics
                 6        7    Grace      Charles           Physics

                   date_of_admission   fee
course
Biology          8        2022-09-12  1500
Chemistry        2        2022-03-18  1500
Computer Science 4        2022-05-26  2000
                 9        2022-10-16  2500
Mathematics      0        2022-01-10  1500
                 3        2022-04-22  2500
                 5        2022-06-30  1500
                 7        2022-08-08  2000
Physics          1        2022-02-14  2000
                 6        2022-07-04  2500

In [34]:
student_df.groupby(['course']).apply(lambda x: x.head(1))

C:\Users\ST\AppData\Local\Temp\ipykernel_10516\4018519365.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  student_df.groupby(['course']).apply(lambda x: x.head(1))

,,roll_no,name,fathername,course,date_of_admission,fee
course,,,,,,,
Biology,8,9,Ivan,Christopher,Biology,2022-09-12,1500
Chemistry,2,3,Charlie,Michael,Chemistry,2022-03-18,1500
Computer Science,4,5,Eva,Richard,Computer Science,2022-05-26,2000
Mathematics,0,1,Alice,John,Mathematics,2022-01-10,1500
Physics,1,2,Bob,Robert,Physics,2022-02-14,2000